{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "EVENT_Illness",
    "1": "EVENT_Accident",
    "2": "EVENT_Other",
    "3": "CAUSE_Material_Physical",
    "4": "CAUSE_Spirits_Gods",
    "5": "CAUSE_Witchcraft_Sorcery",
    "6": "CAUSE_Rule_Violation_Taboo",
    "7": "ACTION_Physical_Material",
    "8": "ACTION_Technical_Specialist",
    "9": "ACTION_Divination",
    "10": "ACTION_Shaman_Medium_Healer",
    "11": "ACTION_Priest_High_Religion"
  },
  "initializer_range": 0.02,
  "label2id": {
    "ACTION_Divination": 9,
    "ACTION_Physical_Material": 7,
    "ACTION_Priest_High_Religion": 11,
    "ACTION_Shaman_Medium_Healer": 10,
    "ACTION_Technical_Specialist": 8,
    "CAUSE_Material_Physical": 3,
    "CAUSE_Rule_Violation_Taboo": 6,
    "CAUSE_Spirits_Gods": 4,
    "CAUSE_Witchcraft_Sorcery": 5,
    "EVENT_Accident": 1,
    "EVENT_Illness": 0,
    "EVENT_Other": 2
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "multi_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.1",
  "vocab_size": 30522
}
