{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "HierarchicalMultiLabelClassifier"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "EVENT",
    "1": "EVENT_Illness",
    "2": "EVENT_Accident",
    "3": "EVENT_Other",
    "4": "CAUSE",
    "5": "CAUSE_Just_Happens",
    "6": "CAUSE_Material_Physical",
    "7": "CAUSE_Spirits_Gods",
    "8": "CAUSE_Witchcraft_Sorcery",
    "9": "CAUSE_Rule_Violation_Taboo",
    "10": "CAUSE_Other",
    "11": "ACTION",
    "12": "ACTION_Physical_Material",
    "13": "ACTION_Technical_Specialist",
    "14": "ACTION_Divination",
    "15": "ACTION_Shaman_Medium_Healer",
    "16": "ACTION_Priest_High_Religion",
    "17": "ACTION_Other"
  },
  "initializer_range": 0.02,
  "label2id": {
    "ACTION": 11,
    "ACTION_Divination": 14,
    "ACTION_Other": 17,
    "ACTION_Physical_Material": 12,
    "ACTION_Priest_High_Religion": 16,
    "ACTION_Shaman_Medium_Healer": 15,
    "ACTION_Technical_Specialist": 13,
    "CAUSE": 4,
    "CAUSE_Just_Happens": 5,
    "CAUSE_Material_Physical": 6,
    "CAUSE_Other": 10,
    "CAUSE_Rule_Violation_Taboo": 9,
    "CAUSE_Spirits_Gods": 7,
    "CAUSE_Witchcraft_Sorcery": 8,
    "EVENT": 0,
    "EVENT_Accident": 2,
    "EVENT_Illness": 1,
    "EVENT_Other": 3
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.42.4",
  "vocab_size": 30522
}
