{
  "_name_or_path": "roberta-base",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "EVENT_Illness",
    "1": "EVENT_Accident",
    "2": "EVENT_Other",
    "3": "CAUSE_Material_Physical",
    "4": "CAUSE_Spirits_Gods",
    "5": "CAUSE_Witchcraft_Sorcery",
    "6": "CAUSE_Rule_Violation_Taboo",
    "7": "ACTION_Physical_Material",
    "8": "ACTION_Technical_Specialist",
    "9": "ACTION_Divination",
    "10": "ACTION_Shaman_Medium_Healer",
    "11": "ACTION_Priest_High_Religion"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ACTION_Divination": 9,
    "ACTION_Physical_Material": 7,
    "ACTION_Priest_High_Religion": 11,
    "ACTION_Shaman_Medium_Healer": 10,
    "ACTION_Technical_Specialist": 8,
    "CAUSE_Material_Physical": 3,
    "CAUSE_Rule_Violation_Taboo": 6,
    "CAUSE_Spirits_Gods": 4,
    "CAUSE_Witchcraft_Sorcery": 5,
    "EVENT_Accident": 1,
    "EVENT_Illness": 0,
    "EVENT_Other": 2
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.41.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
